---
kind: property
id: P:Autodesk.Revit.DB.TableSectionData.FirstRowNumber
source: html/7440bbb6-c7d3-efb2-c509-32f8a0bd518a.htm
---
# Autodesk.Revit.DB.TableSectionData.FirstRowNumber Property

The first row in this section of the table.

## Syntax (C#)
```csharp
public int FirstRowNumber { get; }
```

## Remarks
Some table sections have row 0 as their first row while others start with row 1.